#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
#include <string.h>

//int main() 
//{
//	char a = 3;
//	//00000000 00000000 00000000 00000011 本应是这样的整形,char只有8字节，发生截断，低八位
//	//00000011  a的值
//	char b = 127;
//	//00000000 00000000 00000000 01111111
//	//01111111
//	char c = a + b;
//	//   为提升精度 ，表达式中字符和短整型数在使用之前进行整型提升
//	//符号位不变 从第二位补符号位 至32位
//	//00000000 00000000 00000000 01111111+
//	//00000000 00000000 00000000 00000011 
//	//00000000 00000000 00000000 10000010
//	//10000010 发生截断
//	printf("%d", c);
//	//打印整形
//	//11111111 11111111 11111111 10000010 - 补码
//	//                           10000001
//	//10000000 00000000 00000000 01111110 - -126
//	return 0;
//}


//%d 有符号10进制整数 
//%i 有符号10进制整数
//%o 无符号8进制整数
//%u 无符号10进制整数
//%x 无符号的16进制数字，并以小写abcdef表示
//%X 无符号的16进制数字，并以大写ABCDEF表示
//%F / f 浮点数
//%E / e 用科学表示格式的浮点数
//%g 使用%f和%e表示中的总的位数表示最短的来表示浮点数 G 同g格式，但表示为指数
//%c 单个字符
//%s 字符串


int main() 
{
	return 0;
}